In [1]:
import pandas as pd
import numpy as np

In [3]:
movies_df = pd.read_csv("movies.csv", usecols=["movieId", "title"], dtype={"movieId": "int32", "title": "str"})
ratings_df = pd.read_csv("ratings.csv", usecols=["userId", "movieId", "rating"],
                          dtype={"userId" : "int32", "movieId": "int32", "rating": "float32"})

In [4]:
movies_df.head()

   movieId                               title
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

In [5]:
ratings_df.head()

   userId  movieId  rating
0       1        1     4.0
1       1        3     4.0
2       1        6     4.0
3       1       47     5.0
4       1       50     5.0

In [6]:
df = ratings_df.merge(movies_df, on="movieId")

In [7]:
df.head()

   userId  movieId  rating                        title
0       1        1     4.0             Toy Story (1995)
1       1        3     4.0      Grumpier Old Men (1995)
2       1        6     4.0                  Heat (1995)
3       1       47     5.0  Seven (a.k.a. Se7en) (1995)
4       1       50     5.0   Usual Suspects, The (1995)

In [13]:
combined_movie_ratings = df.dropna(axis=0, subset=["title"])
movie_rating_counts = (combined_movie_ratings.groupby(by=["title"])["rating"]
                       .count().reset_index().rename(columns={"rating": "totalRatingCount"})
                       [["title", "totalRatingCount"]])
movie_rating_counts.head()

                                     title  totalRatingCount
0                               '71 (2014)                 1
1  'Hellboy': The Seeds of Creation (2004)                 1
2                   'Round Midnight (1986)                 2
3                      'Salem's Lot (2004)                 1
4                'Til There Was You (1997)                 2

In [14]:
rating_with_totalRatingCount = combined_movie_ratings.merge(movie_rating_counts, left_on="title", right_on="title", how="left")
rating_with_totalRatingCount.head()

   userId  movieId  rating                        title  totalRatingCount
0       1        1     4.0             Toy Story (1995)               215
1       1        3     4.0      Grumpier Old Men (1995)                52
2       1        6     4.0                  Heat (1995)               102
3       1       47     5.0  Seven (a.k.a. Se7en) (1995)               203
4       1       50     5.0   Usual Suspects, The (1995)               204

In [16]:
pd.set_option("display.float_format", lambda x: '%.3f' %x)
print(movie_rating_counts["totalRatingCount"].describe())

count   9719.000
mean      10.375
std       22.406
min        1.000
25%        1.000
50%        3.000
75%        9.000
max      329.000
Name: totalRatingCount, dtype: float64

In [17]:
popularity_threshold = 50
rating_popular_movies = rating_with_totalRatingCount.query("totalRatingCount >= @popularity_threshold")
rating_popular_movies.head()

   userId  movieId  rating                        title  totalRatingCount
0       1        1   4.000             Toy Story (1995)               215
1       1        3   4.000      Grumpier Old Men (1995)                52
2       1        6   4.000                  Heat (1995)               102
3       1       47   5.000  Seven (a.k.a. Se7en) (1995)               203
4       1       50   5.000   Usual Suspects, The (1995)               204